---
kind: property
id: P:Autodesk.Revit.DB.ConnectorElement.IsPrimary
source: html/92a0eddf-2414-903f-8872-898442426ded.htm
---
# Autodesk.Revit.DB.ConnectorElement.IsPrimary Property

Identifies if this is the primary connector in the family.

## Syntax (C#)
```csharp
public bool IsPrimary { get; }
```